sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
#include "sms_imu.h"
//#include "nrf_drv_delay.h"
#define NRF_LOG_MODULE_NAME "IMU"
#include "nrf_log.h"

extern const nrf_drv_twi_t twi_master_instance;

extern volatile bool twi_xfer_done;

bno055_config_s bno055_config;
bno055_output_s bno055_output;
bno055_interrupt_s bno055_interrupt;

extern const nrf_drv_timer_t TIMER_DELTA_US;

static void writeByte(uint8_t address, uint8_t subAddress, uint8_t data)
{
	uint8_t reg[2] = {subAddress, data};
	twi_xfer_done = false;
	ret_code_t err_code = nrf_drv_twi_tx(&twi_master_instance, address, reg, sizeof(reg), false);
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done) {};
}

static uint8_t readByte(uint8_t address, uint8_t subAddress)
{
	uint8_t reg[1] = {subAddress};
	twi_xfer_done = false;
	ret_code_t err_code = nrf_drv_twi_tx(&twi_master_instance, address, reg, sizeof(reg), false);
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done);
		
	uint8_t data;
	twi_xfer_done = false;
	err_code = nrf_drv_twi_rx(&twi_master_instance, address, &data, sizeof(data));
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done);
	
	return data;
}

static void readBytes(uint8_t address, uint8_t subAddress, uint8_t count, uint8_t *dest)
{
	uint8_t reg[1] = {subAddress};
	twi_xfer_done = false;
	ret_code_t err_code = nrf_drv_twi_tx(&twi_master_instance, address, reg, sizeof(reg), false);
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done);
	
	twi_xfer_done = false;
	err_code = nrf_drv_twi_rx(&twi_master_instance, address, dest, count);
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done);
}

static void bno055_reset(void)
{
	writeByte(BNO055_ADDRESS, BNO055_SYS_TRIGGER, 0x20);
	nrf_delay_ms(500);
}


static uint8_t bno055_check(void)
{
	int ret = 0x0F;
	uint8_t c = readByte(BNO055_ADDRESS, BNO055_CHIP_ID);
	if(app_debug_level) {
		NRF_LOG_INFO("Device returned 0x%02x\r\n", c);
	}
	if(c == 0xA0) ret = 0x07;
	nrf_delay_ms(500);
	c = readByte(BNO055_ADDRESS, BNO055_ACC_ID);
	if(app_debug_level) {
		NRF_LOG_INFO("Accelerometer returned 0x%02x\r\n", c);
	}
	if(c == 0xFB) ret = 0x03;
	nrf_delay_ms(500);
	c = readByte(BNO055_ADDRESS, BNO055_MAG_ID);
	if(app_debug_level) {
		NRF_LOG_INFO("Magnetometer returned 0x%02x\r\n", c);
	}
	if(c == 0x32) ret = 0x01;
	nrf_delay_ms(500);
	c = readByte(BNO055_ADDRESS, BNO055_GYRO_ID);
	if(app_debug_level) {
		NRF_LOG_INFO("Gyroscope returned 0x%02x\r\n", c);
	}
	if(c == 0x0F) ret = 0;
	nrf_delay_ms(500);
	
	return ret;
}



static int bno055_test(void)
{
	// Check software revision ID
	uint8_t swlsb = readByte(BNO055_ADDRESS, BNO055_SW_REV_ID_LSB);
	uint8_t swmsb = readByte(BNO055_ADDRESS, BNO055_SW_REV_ID_MSB);
	if(app_debug_level) {
		NRF_LOG_INFO("Software revision ID: %02x.%02x\r\n", swmsb, swlsb);
	}
	
	// Check bootloader version
	uint8_t blid = readByte(BNO055_ADDRESS, BNO055_BL_REV_ID);
	if(app_debug_level) {
		NRF_LOG_INFO("Bootloader version: %d\r\n", blid);
	}
	
	// Check self-test results
	uint8_t selftest = readByte(BNO055_ADDRESS, BNO055_ST_RESULT);
	if((selftest & 0x01) && (app_debug_level)) {
		NRF_LOG_INFO("Accelerometer passed selftest\r\n");
	}
	if((selftest & 0x02) && (app_debug_level)) {
		NRF_LOG_INFO("Magnetometer passed selftest\r\n");
	}
	if((selftest & 0x04) && (app_debug_level)) {
		NRF_LOG_INFO("Gyroscope passed selftest\r\n");
	}
	if((selftest & 0x08) && (app_debug_level)) {
		NRF_LOG_INFO("MCU passed selftest\r\n");
	}
	
	nrf_delay_ms(1000);
}




static void bno055_init_config_values(void)
{
	bno055_config.g_pwr_mode = NormalG;	// Gyro power mode
	bno055_config.g_scale = GFS_250DPS;	// Gyro full scale
	bno055_config.g_bw = GBW_523Hz;		// Gyro bandwidth
	bno055_config.a_pwr_mode = NormalA;	// Accel power mode
	bno055_config.a_scale = AFS_2G;		// Accel full scale
	bno055_config.a_bw = ABW_1000Hz;	// Accel bandwidth, accel sample rate divided by ABW_divx
	bno055_config.m_pwr_mode = Normal;	// Select magnetometer power mode
	bno055_config.m_op_mode = Regular;	// Select magnetometer perfomance mode
	bno055_config.m_odr = MODR_30Hz;	// Select magnetometer ODR when in BNO055 bypass mode
	bno055_config.pwr_mode = Normalpwr;	// Select BNO055 power mode
	bno055_config.opr_mode = NDOF;		// specify operation mode for sensors
	if(app_debug_level) {
		NRF_LOG_INFO("BNO055 config values initialized\r\n");
	}
}

static void bno055_calibrate_accel_gyro(float *dest1, float *dest2)
{
	uint8_t data[6]; // data array to hold accelerometer and gyro x, y, z, data
	uint16_t ii = 0, sample_count = 0;
	int32_t gyro_bias[3]  = {0, 0, 0}, accel_bias[3] = {0, 0, 0};

	if(app_debug_level) {
		NRF_LOG_INFO("Accel/Gyro Calibration: Put device on a level surface and keep motionless! Wait......");
	}
	nrf_delay_ms(4000);
  
	// Select page 0 to read sensors
	writeByte(BNO055_ADDRESS, BNO055_PAGE_ID, 0x00);
	// Select BNO055 system operation mode as AMG for calibration
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE );
	nrf_delay_ms(25);
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, AMG);
   
	// In NDF fusion mode, accel full scale is at +/- 4g, ODR is 62.5 Hz, set it the same here
	writeByte(BNO055_ADDRESS, BNO055_ACC_CONFIG, bno055_config.a_pwr_mode << 5 | bno055_config.a_bw << 2 | AFS_4G );
	sample_count = 256;
	for(ii = 0; ii < sample_count; ii++) {
		int16_t accel_temp[3] = {0, 0, 0};
		readBytes(BNO055_ADDRESS, BNO055_ACC_DATA_X_LSB, 6, &data[0]);  // Read the six raw data registers into data array
		accel_temp[0] = (int16_t) (((int16_t)data[1] << 8) | data[0]) ; // Form signed 16-bit integer for each sample in FIFO
		accel_temp[1] = (int16_t) (((int16_t)data[3] << 8) | data[2]) ;
		accel_temp[2] = (int16_t) (((int16_t)data[5] << 8) | data[4]) ;
		accel_bias[0]  += (int32_t) accel_temp[0];
		accel_bias[1]  += (int32_t) accel_temp[1];
		accel_bias[2]  += (int32_t) accel_temp[2];
		nrf_delay_ms(20);  // at 62.5 Hz ODR, new accel data is available every 16 ms
	}
	accel_bias[0]  /= (int32_t) sample_count;  // get average accel bias in mg
	accel_bias[1]  /= (int32_t) sample_count;
	accel_bias[2]  /= (int32_t) sample_count;
    
	if(accel_bias[2] > 0L) {accel_bias[2] -= (int32_t) 1000;}  // Remove gravity from the z-axis accelerometer bias calculation
	else {accel_bias[2] += (int32_t) 1000;}

	dest1[0] = (float) accel_bias[0];  // save accel biases in mg for use in main program
	dest1[1] = (float) accel_bias[1];  // accel data is 1 LSB/mg
	dest1[2] = (float) accel_bias[2];          

	// In NDF fusion mode, gyro full scale is at +/- 2000 dps, ODR is 32 Hz
	writeByte(BNO055_ADDRESS, BNO055_GYRO_CONFIG_0, bno055_config.g_bw << 3 | GFS_2000DPS );
	writeByte(BNO055_ADDRESS, BNO055_GYRO_CONFIG_1, bno055_config.g_pwr_mode);
	
