sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
	for(ii = 0; ii < sample_count; ii++) {
		int16_t gyro_temp[3] = {0, 0, 0};
		readBytes(BNO055_ADDRESS, BNO055_GYR_DATA_X_LSB, 6, &data[0]);  // Read the six raw data registers into data array
		gyro_temp[0] = (int16_t) (((int16_t)data[1] << 8) | data[0]) ;  // Form signed 16-bit integer for each sample in FIFO
		gyro_temp[1] = (int16_t) (((int16_t)data[3] << 8) | data[2]) ;
		gyro_temp[2] = (int16_t) (((int16_t)data[5] << 8) | data[4]) ;
		gyro_bias[0]  += (int32_t) gyro_temp[0];
		gyro_bias[1]  += (int32_t) gyro_temp[1];
		gyro_bias[2]  += (int32_t) gyro_temp[2];
		nrf_delay_ms(35);  // at 32 Hz ODR, new gyro data available every 31 ms
	}
	gyro_bias[0]  /= (int32_t) sample_count;  // get average gyro bias in counts
	gyro_bias[1]  /= (int32_t) sample_count;
	gyro_bias[2]  /= (int32_t) sample_count;

	dest2[0] = (float) gyro_bias[0]/16.;  // save gyro biases in dps for use in main program
	dest2[1] = (float) gyro_bias[1]/16.;  // gyro data is 16 LSB/dps
	dest2[2] = (float) gyro_bias[2]/16.;          

	// Return to config mode to write accelerometer biases in offset register
	// This offset register is only used while in fusion mode when accelerometer full-scale is +/- 4g
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE );
	nrf_delay_ms(25);

	//write biases to accelerometer offset registers ad 16 LSB/dps
	writeByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_X_LSB, (int16_t)accel_bias[0] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_X_MSB, ((int16_t)accel_bias[0] >> 8) & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_Y_LSB, (int16_t)accel_bias[1] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_Y_MSB, ((int16_t)accel_bias[1] >> 8) & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_Z_LSB, (int16_t)accel_bias[2] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_Z_MSB, ((int16_t)accel_bias[2] >> 8) & 0xFF);

	// Check that offsets were properly written to offset registers
	if(app_debug_level) {
		NRF_LOG_INFO("Average accelerometer bias = %d, %d, %d\n",\
			(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_X_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_X_LSB)),\
			(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_Y_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_Y_LSB)),\
			(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_Z_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_ACC_OFFSET_Z_LSB)));
	}
	
	//write biases to gyro offset registers
	writeByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_X_LSB, (int16_t)gyro_bias[0] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_X_MSB, ((int16_t)gyro_bias[0] >> 8) & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_Y_LSB, (int16_t)gyro_bias[1] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_Y_MSB, ((int16_t)gyro_bias[1] >> 8) & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_Z_LSB, (int16_t)gyro_bias[2] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_Z_MSB, ((int16_t)gyro_bias[2] >> 8) & 0xFF);

	// Select BNO055 system operation mode
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, bno055_config.opr_mode );

	// Check that offsets were properly written to offset registers
	if(app_debug_level) {
		NRF_LOG_INFO("Average gyro bias = %d, %d, %d\n",\
			(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_X_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_X_LSB)),\
			(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_Y_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_Y_LSB)),\
			(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_Z_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_GYR_OFFSET_Z_LSB)));
	}
	
	nrf_delay_ms(1000);
	
	if(app_debug_level) {
		NRF_LOG_INFO("Accel/Gyro Calibration done!\r\n");
	}
}

static void bno055_calibrate_mag(float *dest1)
{
	uint8_t data[6]; // data array to hold mag x, y, z, data
	uint16_t ii = 0, sample_count = 0;
	int32_t mag_bias[3] = {0, 0, 0};
	int16_t mag_max[3] = {0, 0, 0}, mag_min[3] = {0, 0, 0};

	if(app_debug_level) {
		NRF_LOG_INFO("Mag Calibration: Wave device in a figure eight until done!");
	}
	nrf_delay_ms(4000);

	// Select page 0 to read sensors
	writeByte(BNO055_ADDRESS, BNO055_PAGE_ID, 0x00);
	// Select BNO055 system operation mode as NDOF for calibration
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE );
	nrf_delay_ms(25);
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, AMG );

	// In NDF fusion mode, mag data is in 16 LSB/microTesla, ODR is 20 Hz in forced mode
	sample_count = 256;
	for(ii = 0; ii < sample_count; ii++) {
		int16_t mag_temp[3] = {0, 0, 0};
		readBytes(BNO055_ADDRESS, BNO055_MAG_DATA_X_LSB, 6, &data[0]);  // Read the six raw data registers into data array
		mag_temp[0] = (int16_t) (((int16_t)data[1] << 8) | data[0]) ;   // Form signed 16-bit integer for each sample in FIFO
		mag_temp[1] = (int16_t) (((int16_t)data[3] << 8) | data[2]) ;
		mag_temp[2] = (int16_t) (((int16_t)data[5] << 8) | data[4]) ;
		for (int jj = 0; jj < 3; jj++) {
			if (ii == 0) {
				mag_max[jj] = mag_temp[jj]; // Offsets may be large enough that mag_temp[i] may not be bipolar! 
				mag_min[jj] = mag_temp[jj]; // This prevents max or min being pinned to 0 if the values are unipolar...
			} else {
				if(mag_temp[jj] > mag_max[jj]) mag_max[jj] = mag_temp[jj];
				if(mag_temp[jj] < mag_min[jj]) mag_min[jj] = mag_temp[jj];
			}
		}
		nrf_delay_ms(105);  // at 10 Hz ODR, new mag data is available every 100 ms
	}

	if(app_debug_level) {
		NRF_LOG_INFO("mag x min/max: %d, %d\r\n", mag_min[0], mag_max[0]);
		NRF_LOG_INFO("mag y min/max: %d, %d\r\n", mag_min[1], mag_max[1]);
		NRF_LOG_INFO("mag z min/max: %d, %d\r\n", mag_min[2], mag_max[2]);
	}
	
	mag_bias[0]  = (mag_max[0] + mag_min[0])/2;  // get average x mag bias in counts
	mag_bias[1]  = (mag_max[1] + mag_min[1])/2;  // get average y mag bias in counts
	mag_bias[2]  = (mag_max[2] + mag_min[2])/2;  // get average z mag bias in counts

	dest1[0] = (float) mag_bias[0] / 1.6;  // save mag biases in mG for use in main program
	dest1[1] = (float) mag_bias[1] / 1.6;  // mag data is 1.6 LSB/mg
	dest1[2] = (float) mag_bias[2] / 1.6;          

	// Return to config mode to write mag biases in offset register
	// This offset register is only used while in fusion mode when magnetometer sensitivity is 16 LSB/microTesla
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE );
	nrf_delay_ms(25);

