sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
	//write biases to accelerometer offset registers as 16 LSB/microTesla
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_X_LSB, (int16_t)mag_bias[0] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_X_MSB, ((int16_t)mag_bias[0] >> 8) & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Y_LSB, (int16_t)mag_bias[1] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Y_MSB, ((int16_t)mag_bias[1] >> 8) & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Z_LSB, (int16_t)mag_bias[2] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Z_MSB, ((int16_t)mag_bias[2] >> 8) & 0xFF);

	// Check that offsets were properly written to offset registers
	if(app_debug_level) {
		NRF_LOG_INFO("Average magnetometer bias = %d, %d, %d\n",\
			(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_X_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_X_LSB)),\
			(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Y_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Y_LSB)),\
			(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Z_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Z_LSB)));
	}
	
	// Select BNO055 system operation mode
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, bno055_config.opr_mode);
	nrf_delay_ms(25);

	nrf_delay_ms(1000);
	
	if(app_debug_level) {
		NRF_LOG_INFO("Mag Calibration done!\r\n");
	}
}



// Read accel data
static void read_accel_data(int16_t *destination)
{
	// x/y/z accel register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers into data array
	readBytes(BNO055_ADDRESS, BNO055_ACC_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];      
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];  
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4]; 
}
// Read gyro data
static void read_gyro_data(int16_t *destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_GYR_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];  
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4]; 
}
// Read temperature data
static int16_t read_gyrotemp_data(void)
{
  return readByte(BNO055_ADDRESS, BNO055_TEMP);  // Read the two raw data registers sequentially into data array 
}

// Read magnetometer data
static void read_mag_data(int16_t *destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_MAG_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}

// Read quaternion data
static void read_quat_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[8];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_QUA_DATA_W_LSB, 8, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
	destination[3] = ((int16_t)rawData[7] << 8) | rawData[6];
}

// Read Euler angle data
static void read_euler_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_EUL_HEADING_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}

// Read linear acceleration data
static void read_lia_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_LIA_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}

// Read gravity vector
static void read_grv_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_GRV_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}




void imu_startup(void)
{
	// Initialize all bno055 struct values
	bno055_config.init_ok = true;
	bno055_config.dev_en = false;
	bno055_config.comp_mask = 0x0F;
	for(uint8_t i = 0; i < 3; i++) {
		bno055_config.gyro_bias[i] = 0;
		bno055_config.accel_bias[i] = 0;
		bno055_config.mag_bias[i] = 0;
		bno055_output.accel[i].val = 0;
		bno055_output.gyro[i].val = 0;
		bno055_output.mag[i].val = 0;
		bno055_output.lia[i].val = 0;
		bno055_output.grv[i].val = 0;
	}
	for(uint8_t i = 0; i < 4; i++) {
		bno055_output.quat[i].val = 0;
	}
	bno055_output.temp.val = 0;
	bno055_output.yaw.val = 0;
	bno055_output.roll.val = 0;
	bno055_output.pitch.val = 0;
	bno055_output.ts_us = 0;
	
	// Reset device & check which component is present
	bno055_reset();
	bno055_config.comp_mask = bno055_check();
	if(bno055_config.comp_mask == 0x0F) {
		bno055_config.init_ok = false;
		bno055_config.dev_en = false;
	}
	else {
		bno055_config.init_ok = true;
		bno055_config.dev_en = true;
	}
}


void imu_configure(void)
{
	bno055_test();
	bno055_init_config_values();
//	bno055_calibrate_accel_gyro(bno055_config.accel_bias,
//								bno055_config.gyro_bias);
//	bno055_calibrate_mag(bno055_config.mag_bias);
}


void imu_check_cal(void)
{
	bno055_config.cal_state = readByte(BNO055_ADDRESS, BNO055_CALIB_STAT);
}

